IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/UART0.xml
	<register id="MEM_MVR" acronym="MEM_MVR" offset="0x50" width="32" description="The reset value is fixed by hardware and corresponds to the RTL revision of this module. A reset has no effect on the value returned

Notes:
	UART / IRDA SIR only module is revision 1.x (WMU_012_1 specification).
	UART / IRDA with SIR, MIR and FIR support is revision 2.x (WMU_012_2 specification).
	UART / IRDA with SIR, MIR and FIR / CIR support is revision 3.x (this specification).
For example: MVR = 0x30 => Version 3.0 MVR = 0x38 => Version 3.8">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31 - 30" rwaccess="R"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="Rtl revision number of module" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_SYSC" acronym="MEM_SYSC" offset="0x54" width="32" description="The auto idle bit controls a power saving technique to reduce the logic power consumption of the OCP interface. That is to say when the feature is enabled, the clock will be gated off until an OCP command for this device has been detected. When the software reset bit is set high it causes a full device reset.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="" range="7 - 5" rwaccess="R"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROL REF: OCP DESIGN GUIDELINES VERSION 1.1" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL" range="2" rwaccess="R/W"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0." range="1" rwaccess="W"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SYSS" acronym="MEM_SYSS" offset="0x58" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="" range="7 - 1" rwaccess="R"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_WER" acronym="MEM_WER" offset="0x5C" width="32" description="The UART wakeup enable register is used to mask and unmask a UART event that would subsequently notify the system. The events are any activity in the logic that could cause an interrupt and/ or an activity that would require the system to wakeup. It should be noted that even if the wakeup is disabled for certain events, if these events are also an interrupt to the UART, then the UART will still register the interrupt as such.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_CFPS" acronym="MEM_CFPS" offset="0x60" width="32" description="Since the Consumer IR works at modulation rates of 30  56.8 KHz, the 48 MHz clock must be pre scaled before the clock can drive the IR logic. This register sets the divisor rate to give a range to accommodate the remote control requirements in BAUD multiples of 12x. The value of the CFPS at reset is 0105 decimal which equates to a 38.1 KHz output from starting conditions. The 48 MHz carrier is prescaled by the CFPS which is then divided by the 12x BAUD multiple.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.  Target Freq [KHz]	CFPS [decimal]	Actual Freq[KHz] 	30			133		30.08 	32.75			122		32.79 	36			111		36.04 	36.7			109		36.69 	38*			105		38.1 	40			100		40 	56.8			70		57.14  * configured at reset to this value  Note: CFPS = 0 is not supported." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_RXFIFO_LVL" acronym="MEM_RXFIFO_LVL" offset="0x64" width="32" description="Level of the RX FIFO">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_TXFIFO_LVL" acronym="MEM_TXFIFO_LVL" offset="0x68" width="32" description="Level of the TX FIFO">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="TXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_IER2" acronym="MEM_IER2" offset="0x6C" width="32" description="Enables RX/TX FIFOs empty corresponding interrupts.">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="" range="7 - 3" rwaccess="R"/> 
		<bitfield id="RHR_IT_DIS" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="EN_TXFIFO_EMPTY" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/DISABLES[00 EN_TXFIFO_EMPTY interrupt." range="1" rwaccess="R/W"/> 
		<bitfield id="EN_RXFIFO_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Enables[1]/disables[0] EN_RXFIFO_EMPTY interrupt." range="0" rwaccess="R/W"/>
	</register>
